modul6/ci-news/app/Controllers/BukuController.php

    public function index()
    {
        // Check if user is authenticated
    if (!session()->get('logged_in')) {
        return redirect()->to(base_url('/login'));
    }
        return view('buku/index', [
            'buku' => (new BukuModel())->findAll()
        ]);
---
SELECT *
FROM `buku`

    public function store()
    {
        $buku = new BukuModel();

        $buku->insert([
            'judul' => $this->request->getPost('judul'),
            'penulis' => $this->request->getPost('penulis'),
            'penerbit' => $this->request->getPost('penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
        ]);
---
INSERT INTO `buku` (`judul`, `penulis`, `penerbit`, `tahun_terbit`) VALUES ('Tes', 'Tes', 'Tes', '2024')

    public function edit($id)
    {
        return view('buku/edit', [
            'buku' => (new BukuModel())->find($id)
        ]);
---
SELECT *
FROM `buku`
WHERE `buku`.`id` = '2'

    public function delete($id)
    {
        $buku = new BukuModel();

        $buku->delete($id);
---
DELETE FROM `buku`
WHERE `id` IN ('5')