modul6/ci-news/app/Controllers/UserController.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1
---
    public function login()
    {
        $user = new UserModel();
        $username = $this->request->getPost('username');
        $pw = $this->request->getPost('password');
        $dataUser = $user->where(['username' => $username])->orWhere(['email' => $username])->first();